"""
Задача№4

Користувач вводить рядок і один символ. Напишіть програму для підрахунку
кількості входження символу в рядок. У випадку, якщо введений символ є літерою,
великі і малі букви розрізняються.

Автор: Савченко Валентина
"""

string = input("Введіть рядок: ")
symbol = input("Введіть символ для находження в рядку: ")

find = string.count(symbol)

print(f"Кількість входжень символу '{symbol}' у рядок: {find}")
