"""
Задача№1

Напишіть програму для перетворення десяткового числа у двійкове.

Автор: Савченко Валентина
"""

number = int(input("Уведіть ціле число:"))

print(f"Число {number} у двійковій системі становить: {bin(number)}")
