"""
Задача№2

Напишіть програму, яка по даному числу n від 1 до 9
виводить на екран n пінгвінів. Зображення одного пінгвіна має розмір 5 ×9
символів, між двома сусідніми пінгвінами також є порожній (з пропусків)
стовпець. Дозволяється вивести порожній стовпець після останнього пінгвіна.
Для спрощення малювання скопіюйте пінгвіна з прикладу в середовище розробки.
    _~_   
   (o o)
  /  V  \  
 /(  _  )\
   ^^ ^^  


Автор: Савченко Валентина
"""
num = int(input("Уведіть число від 1 до 9: " ))

s1 = '    _~_    ' * num
s2 = '   (o o)   ' * num
s3 = '  /  V  \  ' * num
s4 = ' /(  _  )\ ' * num
s5 = '   ^^ ^^   ' * num

print(s1) 
print(s2)
print(s3)
print(s4)
print(s5)
