"""
Задача№3

Напишіть програму для друку літери Р висотою 5 рядків за допомогою
введеного користувачем символу.

Автор: Савченко Валентина
"""

symbol = input("Уведіть символ для друку літери: ")

print( f'{symbol} {symbol} {symbol} {symbol}')
print( f'{symbol}     {symbol}')
print( f'{symbol} {symbol} {symbol} {symbol}')
print( symbol)
print( symbol)
